app/controllers/user_stocks_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ?  ORDER BY "stocks"."id" ASC LIMIT 1  [["ticker", "GOOG"]]
INSERT INTO "stocks" ("ticker", "name", "last_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ticker", "GOOG"], ["name", "Alphabet Inc."], ["last_price", 689.04], ["created_at", "2016-05-04 23:18:04.412542"], ["updated_at", "2016-05-04 23:18:04.412542"]]
---
  def create
    if params[:stock_id].present?
      @user_stock = UserStock.new(stock_id: params[:stock_id], user: current_user)
    else
      stock = Stock.find_by_ticker(params[:stock_ticker])
      if stock
        @user_stock = UserStock.new(user: current_user, stock: stock)
      else
        stock = Stock.new_from_lookup(params[:stock_ticker])
        if stock.save

DELETE FROM "user_stocks" WHERE "user_stocks"."id" = ?  [["id", 4]]
---
  def destroy
    @user_stock.destroy

SELECT  "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_user_stock
      @user_stock = UserStock.find(params[:id])